In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
df=pd.read_csv("C:\\Users\\Welcome\\Documents\\Sai1.csv")

In [5]:
df

     customerid  Gender   Age  Annual Income(k$)  Spending Score(1-100)
0             1    Male  21.0               60.0                   94.0
1             2    Male  27.0               75.0                   31.0
2             3  Female  25.0               79.0                   41.0
3             4    Male  39.0               58.0                   21.0
4             5  Female  23.0               59.0                    6.0
..          ...     ...   ...                ...                    ...
195         196    Male  22.0               72.0                   83.0
196         197    Male  27.0               44.0                   49.0
197         198     NaN  29.0               48.0                   82.0
198         199     NaN  28.0               37.0                   63.0
199         200  Female  33.0               63.0                    NaN

[200 rows x 5 columns]

In [6]:
df.mean()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_4352\3759992827.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

customerid               100.500000
Age                       30.025381
Annual Income(k$)         58.510526
Spending Score(1-100)     49.883598
dtype: float64

In [7]:
df.loc[:,'Age'].mean()

30.0253807106599

In [8]:
df.mean(axis=1)[0:4]

C:\Users\Welcome\AppData\Local\Temp\ipykernel_4352\1148177455.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)[0:4]

0    44.00
1    33.75
2    37.00
3    30.50
dtype: float64

In [9]:
df.median()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_4352\4151078170.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

customerid               100.5
Age                       30.0
Annual Income(k$)         58.5
Spending Score(1-100)     49.0
dtype: float64

In [10]:
df.loc[:,'Age'].median()

30.0

In [11]:
df.mode()

     customerid  Gender   Age  Annual Income(k$)  Spending Score(1-100)
0             1  Female  22.0               69.0                   12.0
1             2     NaN  31.0                NaN                   29.0
2             3     NaN   NaN                NaN                    NaN
3             4     NaN   NaN                NaN                    NaN
4             5     NaN   NaN                NaN                    NaN
..          ...     ...   ...                ...                    ...
195         196     NaN   NaN                NaN                    NaN
196         197     NaN   NaN                NaN                    NaN
197         198     NaN   NaN                NaN                    NaN
198         199     NaN   NaN                NaN                    NaN
199         200     NaN   NaN                NaN                    NaN

[200 rows x 5 columns]

In [12]:
df.min()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_4352\1410862080.py:1: FutureWarning: The default value of numeric_only in DataFrame.min is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.min()

customerid                1.0
Age                      20.0
Annual Income(k$)        35.0
Spending Score(1-100)     1.0
dtype: float64

In [13]:
df.loc[:,'Age'].min(skipna = False)

nan

In [14]:
df.max()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_4352\1151452817.py:1: FutureWarning: The default value of numeric_only in DataFrame.max is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.max()

customerid               200.0
Age                       40.0
Annual Income(k$)         80.0
Spending Score(1-100)    100.0
dtype: float64

In [15]:
df.loc[:,'Age'].max(skipna = False)

nan

In [16]:
df.std()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_4352\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

customerid               57.879185
Age                       6.393904
Annual Income(k$)        13.538008
Spending Score(1-100)    29.599942
dtype: float64

In [17]:
df.loc[:,'Age'].std()

6.3939037836141885

In [18]:
df.std(axis=1)[0:4]

C:\Users\Welcome\AppData\Local\Temp\ipykernel_4352\3794102593.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std(axis=1)[0:4]

0    41.368265
1    30.346609
2    32.041640
3    23.245071
dtype: float64

In [21]:
df.groupby(['Gender'])['Age'].mean()

Gender
Female    29.643564
Male      30.048780
Name: Age, dtype: float64

In [25]:
df_u=df.rename(columns= {'Annual Income(k$)	':'Income'},inplace=False)

In [30]:
df_u=df.rename(columns= {'Annual Income(k$)	':'Income'},inplace=False) 
(df_u.groupby(['Genre']).Income.mean())

KeyError: 'Genre'

In [32]:
from sklearn import preprocessing 
enc = preprocessing.OneHotEncoder() 
enc_df = pd.DataFrame(enc.fit_transform(df[['Gender']]).toarray()) 
enc_df

       0    1    2
0    0.0  1.0  0.0
1    0.0  1.0  0.0
2    1.0  0.0  0.0
3    0.0  1.0  0.0
4    1.0  0.0  0.0
..   ...  ...  ...
195  0.0  1.0  0.0
196  0.0  1.0  0.0
197  0.0  0.0  1.0
198  0.0  0.0  1.0
199  1.0  0.0  0.0

[200 rows x 3 columns]

In [33]:
df_encode =df_u.join(enc_df) 
df_encode

,customerid,Gender,Age,Annual Income(k$),Spending Score(1-100),0,1,2
0,1,Male,21.0,60.0,94.0,0.0,1.0,0.0
1,2,Male,27.0,75.0,31.0,0.0,1.0,0.0
2,3,Female,25.0,79.0,41.0,1.0,0.0,0.0
3,4,Male,39.0,58.0,21.0,0.0,1.0,0.0
4,5,Female,23.0,59.0,6.0,1.0,0.0,0.0
...,...,...,...,...,...,...,...,...
195,196,Male,22.0,72.0,83.0,0.0,1.0,0.0
196,197,Male,27.0,44.0,49.0,0.0,1.0,0.0
197,198,NaN,29.0,48.0,82.0,0.0,0.0,1.0
198,199,NaN,28.0,37.0,63.0,0.0,0.0,1.0
199,200,Female,33.0,63.0,NaN,1.0,0.0,0.0

In [34]:
csv_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'

In [35]:
csv_url

'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'

In [38]:
col_names = ['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width','Species']

In [39]:
col_names

['Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width', 'Species']

In [40]:
iris = pd.read_csv(csv_url, names = col_names)

In [41]:
iris

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width         Species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [42]:
import seaborn as sns

In [45]:
data_names=sns.get_dataset_names()
print(data_names)

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic', 'anagrams', 'anagrams', 'anscombe', 'anscombe', 'attention', 'attention', 'brain_networks', 'brain_networks', 'car_crashes', 'car_crashes', 'diamonds', 'diamonds', 'dots', 'dots', 'dowjones', 'dowjones', 'exercise', 'exercise', 'flights', 'flights', 'fmri', 'fmri', 'geyser', 'geyser', 'glue', 'glue', 'healthexp', 'healthexp', 'iris', 'iris', 'mpg', 'mpg', 'penguins', 'penguins', 'planets', 'planets', 'seaice', 'seaice', 'taxis', 'taxis', 'tips', 'tips', 'titanic', 'titanic', 'anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [46]:
df=sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [47]:
irisSet = (iris['Species']== 'Iris-setosa')

In [48]:
irisSet

0       True
1       True
2       True
3       True
4       True
       ...
145    False
146    False
147    False
148    False
149    False
Name: Species, Length: 150, dtype: bool

In [49]:
print('Iris-setosa') 
print(iris[irisSet].describe())

Iris-setosa
       Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

In [50]:
irisVer = (iris['Species']== 'Iris-versicolor')

In [51]:
irisVer

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: Species, Length: 150, dtype: bool

In [52]:
print('Iris-versicolor') 
print(iris[irisVer].describe())

Iris-versicolor
       Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [53]:
irisVir = (iris['Species']== 'Iris-virginica')

In [54]:
irisVir

0      False
1      False
2      False
3      False
4      False
       ...
145     True
146     True
147     True
148     True
149     True
Name: Species, Length: 150, dtype: bool

In [55]:
print('Iris-virginica') 
print(iris[irisVir].describe())

Iris-virginica
       Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000